<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>

  <link rel="stylesheet" href="style.css" type="text/css">

  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>html</title>


</head>


<body>

<div id="Navigation">
<ul class="Navigation">

  <li><a href="index.html">&#1043;&#1083;&#1072;&#1074;&#1085;&#1072;&#1103;</a></li>

  <li><a href="html.html">HTML</a>
    <ul>

    </ul>

  </li>

  <li><a href="css.html">CSS</a></li>

  <li><a href="javascript.html">Java Script</a>
    <ul>

      <li><a href="zadacha1.html">&#1047;&#1072;&#1076;&#1072;&#1095;&#1072; 1</a></li>

      <li><a href="zadacha2.html">&#1047;&#1072;&#1076;&#1072;&#1095;&#1072; 2</a></li>

      <li><a href="zadacha3.html">&#1047;&#1072;&#1076;&#1072;&#1095;&#1072; 3</a></li>

    </ul>

  </li>

</ul>

</div>

<br>

<br>

<br>

<span style="color: rgb(0, 0, 0); font-family: Arial,sans-serif; font-size: 14.72px; font-style: normal; font-weight: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255); display: inline ! important; float: none;"></span>&#1058;&#1077;&#1075;
&lt;tr&gt; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1086;&#1084; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;.
&#1050;&#1072;&#1078;&#1076;&#1072;&#1103; &#1103;&#1095;&#1077;&#1081;&#1082;&#1072; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093; &#1090;&#1072;&#1082;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1090;&#1077;&#1075;&#1072;
&lt;th&gt; &#1080;&#1083;&#1080; &lt;td&gt;.<br>

<br>

&#1069;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; <p2>&lt;table&gt;</p2> &#1089;&#1083;&#1091;&#1078;&#1080;&#1090; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1086;&#1084; &#1076;&#1083;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;,
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;. &#1051;&#1102;&#1073;&#1072;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1089;&#1090;&#1088;&#1086;&#1082; &#1080;
&#1103;&#1095;&#1077;&#1077;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1079;&#1072;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1090;&#1077;&#1075;&#1086;&#1074; &lt;tr&gt; &#1080;
&lt;td&gt;<br>

<br>

&#1058;&#1077;&#1075; <p3>&lt;body&gt;</p3> &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103;
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;
&#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1085;&#1072; &#1074;&#1077;&#1073;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;. &#1055;&#1086;&#1076;&#1086;&#1073;&#1085;&#1072;&#1103; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1072; &#1074; HTML 4 &#1086;&#1089;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103;
&#1080; &#1074;&#1079;&#1072;&#1084;&#1077;&#1085; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;&#1086;&#1081; &#1089;&#1093;&#1077;&#1084;&#1099; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1090;&#1080;&#1083;&#1080;,
&#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1103; &#1080;&#1093; &#1082; &#1089;&#1077;&#1083;&#1077;&#1082;&#1090;&#1086;&#1088;&#1091; BODY.<br>

<br>

&#1058;&#1077;&#1075; &lt;head&gt; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;,
&#1094;&#1077;&#1083;&#1100; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &mdash; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1091; &#1074; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;. &#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077;
&#1090;&#1077;&#1075;&#1072; &lt;head&gt; &#1085;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1085;&#1072; &#1074;&#1077;&#1073;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;, &#1079;&#1072;
&#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1090;&#1077;&#1075;&#1072; <p1>&lt;title&gt;</p1>&#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1086;&#1082;&#1085;&#1072;
&#1074;&#1077;&#1073;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;.<br>

<br>

&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;. &#1069;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &lt;title&gt; &#1085;&#1077;
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080; &#1085;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1085;&#1072; &#1074;&#1077;&#1073;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;. &#1042;
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; Windows &#1090;&#1077;&#1082;&#1089;&#1090; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1083;&#1077;&#1074;&#1086;&#1084;
&#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091; &#1086;&#1082;&#1085;&#1072; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1072;. &#1044;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1090;&#1077;&#1075;
&lt;title&gt; &#1085;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1077;
&lt;head&gt;.<br>

<br>

&#1058;&#1077;&#1075; &lt;style&gt; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1080;&#1083;&#1077;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;
&#1074;&#1077;&#1073;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;. &#1058;&#1077;&#1075; &lt;style&gt; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080;
&#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072; &lt;head&gt;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1077;&#1077; &#1095;&#1077;&#1084; &#1086;&#1076;&#1080;&#1085; &#1090;&#1077;&#1075;
&lt;style&gt;.<br>

<br>

&#1058;&#1077;&#1075; &lt;html&gt; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1086;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1074; &#1089;&#1077;&#1073;&#1077;
&#1074;&#1089;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1074;&#1077;&#1073;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1090;&#1077;&#1075;&#1080; &lt;head&gt;&#1080;
&lt;body&gt;. &#1054;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1080; &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1090;&#1077;&#1075;&#1080;
&lt;html&gt; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;, &#1085;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1081; &#1089;&#1090;&#1080;&#1083;&#1100;
&#1076;&#1080;&#1082;&#1090;&#1091;&#1077;&#1090; &#1085;&#1077;&#1087;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1077; &#1080;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;. &#1050;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;, &#1090;&#1077;&#1075;
&lt;html&gt; &#1080;&#1076;&#1077;&#1090; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; &#1074;&#1090;&#1086;&#1088;&#1099;&#1084;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1090;&#1080;&#1087;&#1072;
&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; (Document Type Definition, DTD), &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079;
&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &lt;!DOCTYPE&gt;. &#1047;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1090;&#1077;&#1075; &lt;html&gt;
&#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1089;&#1090;&#1086;&#1103;&#1090;&#1100; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084;.<br>

<br>

&#1069;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &lt;!DOCTYPE&gt; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1090;&#1080;&#1087;&#1072;
&#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &mdash; DTD (document type definition, &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
&#1090;&#1080;&#1087;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;). &#1069;&#1090;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1083;, &#1082;&#1072;&#1082; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;
&#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1074;&#1077;&#1073;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; HTML &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074;
&#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1093;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; XHTML (EXtensible HyperText
Markup Language, &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1099;&#1081; &#1103;&#1079;&#1099;&#1082; &#1088;&#1072;&#1079;&#1084;&#1077;&#1090;&#1082;&#1080; &#1075;&#1080;&#1087;&#1077;&#1088;&#1090;&#1077;&#1082;&#1089;&#1090;&#1072;), &#1087;&#1086;&#1093;&#1086;&#1078;&#1080;&#1081; &#1085;&#1072;
HTML, &#1085;&#1086; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1089; &#1085;&#1080;&#1084; &#1087;&#1086; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;&#1091;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088; &laquo;&#1085;&#1077;
&#1087;&#1091;&#1090;&#1072;&#1083;&#1089;&#1103;&raquo; &#1080; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1083;, &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; &#1082;&#1072;&#1082;&#1086;&#1084;&#1091; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1091; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;
&#1074;&#1077;&#1073;-&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1082;&#1086;&#1076;&#1072; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100;
&lt;!DOCTYPE&gt;.<br>

&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1080;&#1076;&#1086;&#1074; &lt;!DOCTYPE&gt;, &#1086;&#1085;&#1080; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;
&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1103;&#1079;&#1099;&#1082;&#1072;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099;.<br>

<br>

<span style="color: rgb(0, 0, 0); font-family: Arial,sans-serif; font-size: 14.72px; font-style: normal; font-weight: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255); display: inline ! important; float: none;"><br>

</span><span style="color: rgb(0, 0, 0); font-family: Arial,sans-serif; font-size: 14.72px; font-style: normal; font-weight: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255); display: inline ! important; float: none;"><br>

</span>
</body>
</html>
